/* 초기 북마크 상태 ----------------------------------------------------------------- */

// initBookmark

/* 북마크 리듀서 (순수) 함수 ---------------------------------------------------------- */

// bookmarkReducer

/* 액션 상태 ----------------------------------------------------------------------- */

// CREATE / UPDATE / DELETE / READ

/* 액션 크리에이터 ------------------------------------------------------------------ */

// addBookmarkAction
// updateBookmarkAction
// deleteBookmarkAction
// readAllBookmarkAction

/* 북마크 컨텍스트 객체 생성 ----------------------------------------------------------- */

// BookmarkContext

// 북마크 컨텍스트 프로바이더 래퍼 컴포넌트 내보내기

// BookmarkProvider

/* 고차 컴포넌트(HOC): 컨텍스트 값을 context props로 전달 ---------------------------------- */

// withBookmark

/* 커스텀 훅: 컨텍스트 값을 반환 -------------------------------------------------------- */

// useBookmark
